Revit 2027 API
DefinitionBindingMap.Clear Method
Removes every binding from the map, rendering it empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
public:
virtual void Clear()
abstract Clear : unit -> unit
override Clear : unit -> unit
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace